
** Emissivity versus T of the diagnostic lines
:LOGBOOK:
- Note taken on [2024-11-29 Fri 11:54] \\
  I vastly expanded the notebook and calculated the log-log slopes q for each emission line, and thus the bias factors Q for each ratio
:END:
- This is done using PyNeb in the following notebook
  - [[file:../notebooks/oxygen-emissivities.ipynb]]
- With corresponding python version
  - [[file:../notebooks/oxygen-emissivities.py]]
- Command to sync between them:
  #+begin_src sh :dir ../notebooks :results output
    uv run jupytext --show-changes --update --sync *.py
  #+end_src

  #+RESULTS:
  #+begin_example
  [jupytext] Reading oxygen-emissivities.py in format py
  [jupytext] Loading oxygen-emissivities.ipynb
  [jupytext] Updating oxygen-emissivities.ipynb with this change:
  @@ -310,21 +310,21 @@
       }
      ],
      "source": [
  -    "fig, ax = plt.subplots(figsize=(8, 8))\n",
  +    "fig, ax = plt.subplots(figsize=(7, 7))\n",
       "density = 1e2\n",
       "T0 = 10_000.0\n",
       "\n",
       "em = oii_multiplet_sum_emissivity(temperatures, density)\n",
       "em = normalize(temperatures, em)\n",
  -    "ax.plot(temperatures, em, label=\"O II V1\", ls=\"-\", lw=6)\n",
  +    "ax.plot(temperatures, em, label=\"O II V1\", ls=\"-\", lw=4)\n",
       "\n",
       "em = oii_multiplet_sum_emissivity(temperatures, density, multiplet=V15_mult)\n",
       "em = normalize(temperatures, em)\n",
  -    "ax.plot(temperatures, em, label=\"O II V15\", ls=\"--\", lw=6)\n",
  +    "ax.plot(temperatures, em, label=\"O II V15\", ls=\"--\", lw=4)\n",
       "\n",
       "em = oii_multiplet_sum_emissivity(temperatures, density, multiplet=V3d_4f)\n",
       "em = normalize(temperatures, em)\n",
  -    "ax.plot(temperatures, em, label=\"O II 3d-4f\", ls=\":\", lw=6)\n",
  +    "ax.plot(temperatures, em, label=\"O II 3d-4f\", ls=\":\", lw=4)\n",
       "\n",
       "em = oiiic.getEmissivity(tem=temperatures, den=density, wave=5007)\n",
       "em = normalize(temperatures, em)\n",
  [jupytext] Updating the timestamp of oxygen-emissivities.py
  #+end_example

- Command execute the notebook
  #+begin_src sh :dir ../notebooks :results output
    uv run jupyter execute oxygen-emissivities.ipynb
  #+end_src

  #+RESULTS:

- This produces the figure [[file:../notebooks/oplusplus-emissivity-vs-t-loglog.pdf]] 


